---
kind: method
id: M:Autodesk.Revit.DB.Reference.CreateReferenceInLink
source: html/20a8bee7-2378-c0a6-36f0-07ca42eaedc3.htm
---
# Autodesk.Revit.DB.Reference.CreateReferenceInLink Method

Creates a Reference in an RVT Link from a Reference in the RVT host file.

## Syntax (C#)
```csharp
public Reference CreateReferenceInLink()
```